monkeyboard/HD44780-LCD-for-MonkeyBUS-PIC18/Firmware/main.c
    if(USBUSARTIsTxTrfReady())
    {
		numBytesRead = getsUSBUSART(USB_Out_Buffer,64);
		
		if(numBytesRead != 0)
		{
			BYTE i;
			BYTE byteIN;

			byteIN=numBytesRead;
	        
			if (USB_Out_Buffer[0]==0xfe)	// Starting header of Matrix Orbital protocol
			{
				byteIN--;
				while(byteIN==0)	// This is not a very good loop, it assumed the sender will 
									// keep on sending data.  Ideally the getsUSBUSART should be placed in interrupt.
				{
					while(!USBUSARTIsTxTrfReady());
					numBytesRead = getsUSBUSART(&USB_Out_Buffer[1],64);
					byteIN = byteIN + numBytesRead;
				}
				
				byteIN--;
				switch(USB_Out_Buffer[1])		
				{
					case 71:	// Set cursor position
							
							i = USB_Out_Buffer[2] - 1;	// Column byte
							switch (USB_Out_Buffer[3])	// Row byte
							{
								case 2:
										i +=0x40;
										break;
								case 3:
										i += 0x14;
										break;
								case 4:
										i += 0x54;
										break;
								default:
										break;
							}
							LCD_WriteByte(COMMAND, 0b10000000 + i);
							break;

					case 72:	// Cursor home
							LCD_WriteByte(COMMAND, 2);
							break;

					case 74:	// Underline Cursor On
							LCD_WriteByte(COMMAND, 0b00001110);
							break;
					
					case 75: 	// Underline Cursor Off
							LCD_WriteByte(COMMAND, 0b00001100);
							break;
		
					case 83:	// Block Cursor On
							LCD_WriteByte(COMMAND, 0b00001101);
							break;

					case 84:	// Block Cursor Off
							LCD_WriteByte(COMMAND, 0b00001100);
							break;

					case 76:	// Move cursor left
							LCD_WriteByte(COMMAND,16);
							break;

					case 77:	// Move cursor right
							LCD_WriteByte(COMMAND,20);
							break;

					case 78:	// Define custom character
							while (byteIN<9)					// This again is not a good loop, it assumed protocol 0xFE 0x4E
							{									// will keep on sending data.  
								while(!USBUSARTIsTxTrfReady());
								numBytesRead = getsUSBUSART(&USB_Out_Buffer[byteIN+2],64);
								byteIN = byteIN + numBytesRead;
							}

							i=USB_Out_Buffer[2] << 3;			// Each character is 8 bytes, shifting left 3 to multiply 
																// character memory position by 8
							
							LCD_WriteByte(COMMAND, 0x40 | i);	// Set DDRAM address command
							for (i=0;i<8;i++)
							{
								LCD_WriteByte(DATA, USB_Out_Buffer[3+i]);	// 8 bytes data to form character after set DDRAM command
							}
							break;

					case 88:	// Clear LCD
							LCD_WriteByte(COMMAND, 1);
							break;

					case 81:	// Auto scroll on
							LCD_WriteByte(COMMAND, 7);
							break;
	
					case 82:	// Auto scroll off
							LCD_WriteByte(COMMAND, 6);
							break;
				
					case 152:	// Backlight brightness
							while (byteIN<2)					// This again is not a good loop, it assumed protocol 0xFE 0x4E
							{									// will keep on sending data.  
								while(!USBUSARTIsTxTrfReady());
								numBytesRead = getsUSBUSART(&USB_Out_Buffer[byteIN+2],64);
								byteIN = byteIN + numBytesRead;
							}

							CCPR1L = USB_Out_Buffer[2];			// Third byte of the command is the value of the brightness	
							break;

					default:
							break;

				}	
			}
			else
			{	// if not Matrix Orbital starting command, proceed to output as data.
				for(i=0;i<numBytesRead;i++)
				{
					switch(USB_Out_Buffer[i])
					{
						case 0x0A:
						case 0x0D:
							//USB_In_Buffer[i] = USB_Out_Buffer[i];
							LCD_WriteByte(COMMAND,1);		// clear LCD command if receive 
							break;
						default:
							//USB_In_Buffer[i] = USB_Out_Buffer[i] ;
							LCD_WriteByte(DATA,USB_Out_Buffer[i]);
							break;
					}

				}
			}
		}
	}

    CDCTxService();
}		//end ProcessIO

/********************************************************************
 * Function:        void BlinkUSBStatus(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        BlinkUSBStatus turns on and off LEDs 
 *                  corresponding to the USB device state.
 *
 * Note:            mLED macros can be found in HardwareProfile.h
 *                  USBDeviceState is declared and updated in
 *                  usb_device.c.
 *******************************************************************/
void BlinkUSBStatus(void)
{
    static WORD led_count=0;
    
    if(led_count == 0)led_count = 10000U;
    led_count--;

    #define mLED_Both_Off()         {mLED_1_Off();mLED_2_Off();}
    #define mLED_Both_On()          {mLED_1_On();mLED_2_On();}
    #define mLED_Only_1_On()        {mLED_1_On();mLED_2_Off();}
    #define mLED_Only_2_On()        {mLED_1_Off();mLED_2_On();}

    if(USBSuspendControl == 1)
    {
        if(led_count==0)
        {
            mLED_1_Toggle();
            if(mGetLED_1())
            {
                mLED_2_On();
            }
            else
            {
                mLED_2_Off();
            }
        }//end if
    }
    else
    {
        if(USBDeviceState == DETACHED_STATE)
        {
            mLED_Both_Off();
        }
        else if(USBDeviceState == ATTACHED_STATE)
        {
            mLED_Both_On();
        }
        else if(USBDeviceState == POWERED_STATE)
        {
            mLED_Only_1_On();
        }
        else if(USBDeviceState == DEFAULT_STATE)
        {
            mLED_Only_2_On();
        }
        else if(USBDeviceState == ADDRESS_STATE)
        {
            if(led_count == 0)
            {
                mLED_1_Toggle();
                mLED_2_Off();
            }//end if
        }
        else if(USBDeviceState == CONFIGURED_STATE)
        {
            if(led_count==0)
            {
                mLED_1_Toggle();
                if(mGetLED_1())
                {
                    mLED_2_Off();
                }
                else
                {
                    mLED_2_On();
                }
            }//end if
        }//end if(...)
    }//end if(UCONbits.SUSPND...)

}//end BlinkUSBStatus




// ******************************************************************************************************
// ************** USB Callback Functions ****************************************************************
// ******************************************************************************************************
// The USB firmware stack will call the callback functions USBCBxxx() in response to certain USB related
// events.  For example, if the host PC is powering down, it will stop sending out Start of Frame (SOF)
// packets to your device.  In response to this, all USB devices are supposed to decrease their power
// consumption from the USB Vbus to <2.5mA each.  The USB module detects this condition (which according
// to the USB specifications is 3+ms of no bus activity/SOF packets) and then calls the USBCBSuspend()
// function.  You should modify these callback functions to take appropriate actions for each of these
// conditions.  For example, in the USBCBSuspend(), you may wish to add code that will decrease power
// consumption from Vbus to <2.5mA (such as by clock switching, turning off LEDs, putting the
// microcontroller to sleep, etc.).  Then, in the USBCBWakeFromSuspend() function, you may then wish to
// add code that undoes the power saving things done in the USBCBSuspend() function.

// The USBCBSendResume() function is special, in that the USB stack will not automatically call this
// function.  This function is meant to be called from the application firmware instead.  See the
// additional comments near the function.

